OPTIONAL_FIELD_TEXT = " или `-`, чтобы пропустить"


PRODUCT_NOT_FOUND_TEXT = "❌ Товар не найден"
PRODUCT_DELETED_TEXT = "✅ Товар удалён"
CANCEL_UPDATE_PRODUCT_TEXT = "Редактирование товара отменено"
CANCEL_CREATE_PRODUCT_TEXT = "Создание товара отменено"

INPUT_PRODUCT_NAME_TEXT = "🛍️ Введите название товара"
PRODUCT_NAME_ATTENTION_TEXT = "⚠️ Введите только буквы для названия товара"

INPUT_PRICE_TEXT = "💰 Введите цену товара (число, в рублях)"
PRICE_ATTENTION_TEXT = "⚠️ Введите только цифры."

INPUT_DESCRIPTION_TEXT = "📝 Введите описание товара"

INPUT_PHOTO_TEXT = "📸 Отправьте фото товара"
PHOTO_ATTENTION_TEXT = (
    "⚠️ Отправьте фото в виде файла или в сообщении введите только '-'"
)

INPUT_CATEGORY_TEXT = "📂 Введите ID (число) категории. "
INPUT_NEW_CATEGORY_TEXT = "Для создания новой категории введите её название"
CATEGORY_ATTENTION_TEXT = (
    "⚠️ Введите число/название из таблицы категорий или новое название"
)
CATEGORY_NOT_FOUND_TEXT = "❌ Категория не найдена"
NO_CATEGORIES_TEXT = "Категории отсутствуют"

CART_EMPTY_TEXT = "🛒 Корзина пуста"

INPUT_USER_NAME_TEXT = "Введите ваше имя:"

INPUT_PHONE_TEXT = "Введите ваш номер телефона:"
PHONE_ATTENTION_TEXT = "⚠️ Введите номер телефона начиная с '+7' или '8'"

CHOOSE_DELIVERY_TYPE_TEXT = "Выберите способ доставки:"
CHOOSE_PICKUP_POINT_TEXT = "📍 Выберите пункт самовывоза:"
NO_PICKUP_POINTS_TEXT = "Пункты самовывоза отсутствуют"
INPUT_ADDRESS_TEXT = "Введите адрес доставки:"
